# 1: საქართველოს მოსახლეობა
total_population = 3_700_000

# 2: ზრდასრული მოსახლეობა და ყავის მოხმარების %-ის გაგება
adult_share = 0.75  # დაახლოებით 75% მოსახლეობის არის ზრდასრული
coffee_drinker_share = 0.70  # დაახლოებით 70% ზრდასრული მოსახლეობის მოიხმარს ყავას
adult_population = total_population * adult_share   # 3 700 000 * 0.75 = 2 775 000 ადამიანი (დაახლოებით) არის ზრდასრული
coffee_drinkers = adult_population * coffee_drinker_share # 2 800 000 * 0.7 = 1 942 500 ადამიანი (დაახლოებით) მოიხმარს ყავას

# 3: დაახლოებითი % ყავის მომხმარებლებისა, რომლებიც იყენებენ კაფსულებს (დავუშვათ დაახლოებით 10-20%)
capsule_user_lower = 0.10  # 10% დაბალი მაჩვენებელი
capsule_user_upper = 0.20  # 20% მაღალი მაჩვენებელი
capsule_user_mid = (capsule_user_lower + capsule_user_upper) / 2  # საშუალოდ 15% მომხმარებლებისა მოიხმარს ყავის კაფსულებს
capsule_users = coffee_drinkers * capsule_user_mid # 2,000,000 * 0.15 = 291,375 ადამიანი დაახლოებით მოიხმარს ყავის კაფსულებს

# 4: დაახლოებითი რაოდენობა ყოველთვიურად რამდენ კაფსულას მოიხმარს საშუალოდ 1 ადამიანი
avg_capsules_per_user_per_month = 45  # დავუშვათ საშუალოდ ადამიანი მოიხმარს 1-2 კაფსულას დღეში, საშუალოდ ერთ მომხმარებელი თვეში მოიხმარს 45 ყავის კაფსულას

# 5: მთლიანი გაყიდული კაფსულების რაოდენობა (კაფსულის მომხმარებელი * საშუალოდ მოხმარებული კაფსულის რაოდენობაზე თითო ადამიანზე ყოველთვიურად)
monthly_capsules = capsule_users * avg_capsules_per_user_per_month # 291,375 * 45 = 13 200 000 ყოველთვიურად საქართველოში დაახლოებით შეიძლება გაიყიდოს 13 200 000 ყავის კაფსულა

# 6: საბოლოო შედეგის გამოპრინტვა
print(f"Meama-ს ყავის კაფსულების ყოველთვიურად გაყიდული რაოდენობა: {(int(monthly_capsules)):,} კაფსულა.")

